W8D1/reddit_clone/app/controllers/subs_controller.rb

    def update
        @sub = Sub.find_by(id: params[:id])
        @sub.moderator_id = current_user.id
        if @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "new title"], ["description", "new description"], ["updated_at", "2021-01-11 19:50:10.079073"], ["id", 1]]

    def require_moderator
        @sub = Sub.find_by(id: params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]