W6D3/first_routes_controllers/app/controllers/art_works_controller.rb

  def index

    if params.has_key?(:user_id)
      @artwork = ArtWork.where(artist_id: params[:user_id])
    else
      @artwork = ArtWork.all
---
SELECT "art_works".* FROM "art_works"

  def create
    artwork = ArtWork.new(artwork_params)

    if artwork.save
---
INSERT INTO "art_works" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Sea"], ["image_url", "sea.com\n"], ["artist_id", 8]]

  def show
    artwork = ArtWork.find(params[:id])
---
SELECT  "art_works".* FROM "art_works" WHERE "art_works"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def update
    artwork = ArtWork.find(params[:id])

    if artwork.update(artwork_params)
---
SELECT  "art_works".* FROM "art_works" WHERE "art_works"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "art_works" SET "image_url" = $1 WHERE "art_works"."id" = $2  [["image_url", "sea.com"], ["id", 10]]

  def destroy
    artwork = ArtWork.find(params[:id])

    if artwork.destroy
---
SELECT  "art_works".* FROM "art_works" WHERE "art_works"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "art_works" WHERE "art_works"."id" = $1  [["id", 10]]