W11D4/benchbnb/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "you"], ["LIMIT", 1]]
---
    def self.find_by_credentials(username, pw)
        user = User.find_by(username: username)