W6D4/ninty_nine_cats/app/controllers/cats_controller.rb

    def update
        cat = Cat.find_by(id: params[:id])

        if cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["name", "New Name"], ["description", " almost newborn cat!"], ["updated_at", "2021-01-01 00:37:08.218503"], ["id", 5]]