W8D1/reddit_clone/app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom::base64
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "l3eUqpZJ4GuhkIS6oYqptw=="], ["updated_at", "2021-01-11 22:08:45.753400"], ["id", 1]]