W7D2/music_app/app/controllers/albums_controller.rb

  def create
    @album = Album.new(name: params[:band][:name])
    if @album.save
---
INSERT INTO "albums" ("title", "year", "band_id", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Adventure"], ["year", 2000], ["band_id", 2], ["live", true], ["created_at", "2021-01-11 05:49:26.954673"], ["updated_at", "2021-01-11 05:49:26.954673"]]

  def update
    @album = Album.find_by(id: params[:id])
    if @album.update(name: params[:band][:name])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "title" = $1, "year" = $2, "updated_at" = $3 WHERE "albums"."id" = $4  [["title", "Adventure"], ["year", 1990], ["updated_at", "2021-01-11 06:38:25.897471"], ["id", 8]]

  def destroy
    @album = Album.find_by(id: params[:id])
    @album.destroy
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 1]]