W7D2/music_app/app/controllers/bands_controller.rb

  def create
    @band = Band.new(name: params[:band][:name])
    if @band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Band 25"], ["created_at", "2021-01-11 01:55:24.118282"], ["updated_at", "2021-01-11 01:55:24.118282"]]

  def update
    @band = Band.find_by(id: params[:id])
    if @band.update(name: params[:band][:name])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Band 26"], ["updated_at", "2021-01-11 01:56:13.557402"], ["id", 1]]